In [1]:
import numpy as np
import pandas as pd

In [2]:
sozlukVerisi = {"İstanbul" : [30,25,np.nan], "Ankara" : [15,np.nan,22], "İzmir" : [32,35,36]}

In [3]:
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    15.0     32
1      25.0     NaN     35
2       NaN    22.0     36

In [5]:
havaDurumuDataFrame.dropna()
#eksik veri bulunan satırlar silindi

   İstanbul  Ankara  İzmir
0      30.0    15.0     32

In [6]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    15.0     32
1      25.0     NaN     35
2       NaN    22.0     36

In [8]:
havaDurumuDataFrame.dropna(axis=1)
#eksik veri bulunan sütunlar silindi

   İzmir
0     32
1     35
2     36

In [10]:
yeniSozlukVerisi = {"İstanbul" : [30,25,np.nan], "Ankara" : [15,np.nan,22], "İzmir" : [32,35,36], "Antalya" : [40,np.nan,np.nan]}
yeniHavaDurumuDataFrame = pd.DataFrame(yeniSozlukVerisi)

In [11]:
yeniHavaDurumuDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    15.0     32     40.0
1      25.0     NaN     35      NaN
2       NaN    22.0     36      NaN

In [32]:
yeniHavaDurumuDataFrame.dropna(axis=1, thresh=2)
#thresh(treshold) ile limit konulur. Bu örnekte 2 ve üzeri nan değer bulunan sütunlar silinir

   İstanbul  Ankara  İzmir
0      30.0    15.0     32
1      25.0     NaN     35
2       NaN    22.0     36

In [33]:
yeniHavaDurumuDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    15.0     32     40.0
1      25.0     NaN     35      NaN
2       NaN    22.0     36      NaN

In [34]:
yeniHavaDurumuDataFrame.fillna(20)
#nan değerleri belirtilen değer ile doldurur

   İstanbul  Ankara  İzmir  Antalya
0      30.0    15.0     32     40.0
1      25.0    20.0     35     20.0
2      20.0    22.0     36     20.0

# groupby

In [35]:
maasSozlugu = {"Departman" : ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
              "Calisan Ismi" : ["Ahmet", "Mehmet", "Yusuf", "Zeynep", "Ayse", "Burak"],
               "Maas" : [100,150,200,300,400,500]
              }

In [36]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [37]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama        Yusuf   200
3  Pazarlama       Zeynep   300
4      Hukuk         Ayse   400
5      Hukuk        Burak   500

In [38]:
grupObjesi = maasDataFrame.groupby("Departman")

In [39]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [40]:
grupObjesi.mean()

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [41]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Hukuk             Ayse   400
Pazarlama        Yusuf   200
Yazılım          Ahmet   100

In [42]:
grupObjesi.max()

          Calisan Ismi  Maas
Departman
Hukuk            Burak   500
Pazarlama       Zeynep   300
Yazılım         Mehmet   150

In [43]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0